In [1]:
import matplotlib.pyplot as plt
import pandas as pd

In [10]:
#for csv
#df1 = pd.read_csv(\"data/mexico-real-estate-1.csv\")
#df2 = pd.read_csv(\"data/mexico-real-estate-2.csv\")
#df3 = pd.read_csv(\"data/mexico-real-estate-3.csv\")

In [2]:
df1 = pd.read_excel(r"C:\Users\User\anaconda3\Lib\site-packages\sklearn\datasets\data\mexico folder\mexico 1.xlsx")
df2 = pd.read_excel(r"C:\Users\User\anaconda3\Lib\site-packages\sklearn\datasets\data\mexico folder\mexico 2.xlsx")
df3 = pd.read_excel(r"C:\Users\User\anaconda3\Lib\site-packages\sklearn\datasets\data\mexico folder\mexico 3.xlsx")

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     700 non-null    int64
 1   property_type  700 non-null    object
 2   state          700 non-null    object
 3   lat            583 non-null    float64
 4   lon            583 non-null    float64
 5   area_m2        700 non-null    int64
 6   price_usd      700 non-null    float64
dtypes: float64(3), int64(2), object(2)
memory usage: 38.4+ KB

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     700 non-null    int64
 1   property_type  700 non-null    object
 2   state          700 non-null    object
 3   lat            571 non-null    float64
 4   lon            571 non-null    float64
 5   area_m2        700 non-null    int64
 6   price_mxn      700 non-null    int64
dtypes: float64(2), int64(3), object(2)
memory usage: 38.4+ KB

In [10]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               700 non-null    int64
 1   property_type            700 non-null    object
 2   place_with_parent_names  700 non-null    object
 3   lat-lon                  582 non-null    object
 4   area_m2                  700 non-null    int64
 5   price_usd                700 non-null    float64
dtypes: float64(1), int64(2), object(3)
memory usage: 32.9+ KB

In [12]:
#in df1 (1)drop rows with NAN, (2) replace $ with nothing and replace , with nothing, because its excel file it dosent show the comman and $ but its there in csv file\n",
df1.dropna(inplace=True)
#df1["price_usd"] = (df1["price_usd"].str.replace("$", "", regex=False).str.replace(",", "").astype(float))

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 583 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     583 non-null    int64
 1   property_type  583 non-null    object
 2   state          583 non-null    object
 3   lat            583 non-null    float64
 4   lon            583 non-null    float64
 5   area_m2        583 non-null    int64
 6   price_usd      583 non-null    float64
dtypes: float64(3), int64(2), object(2)
memory usage: 36.4+ KB

In [16]:
#First, drop rows with NaN values in df2. Next, use the \"price_mxn\" column to create a new column named \"price_usd\". (Keep in mind that, when this data was collected in 2014, a dollar cost 19 pesos.) Finally, drop the \"price_mxn\" from the DataFrame.\n",

df2.dropna(inplace=True)
df2["price_usd"]=(df2["price_mxn"])
#df2["price_usd"]=(df2["price_mxn\"])/19).round(2) [ it didnt work maybe because the excel file dosent show the comma at the back of the filemxn\n",
df2.drop(columns=["price_mxn"], inplace=True)
df2.head()

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,apartment,Nuevo León,25.721081,-100.345581,72,1300000
2,3,house,Morelos,23.634501,-102.552788,360,5300000
6,7,apartment,Estado de México,19.272040,-99.572013,85,1250000
7,8,house,San Luis Potosí,22.138882,-100.996510,158,2120000
8,9,apartment,Distrito Federal,19.394558,-99.129707,65,758190

In [21]:
#split latitude in df 3 and drop lat-lon
df3[["lat","lon"]]=df3["lat-lon"].str.split(",", expand= True)
df3.drop(columns=["lat-lon"], inplace= True)
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               700 non-null    int64
 1   property_type            700 non-null    object
 2   place_with_parent_names  700 non-null    object
 3   area_m2                  700 non-null    int64
 4   price_usd                700 non-null    float64
 5   lat                      582 non-null    object
 6   lon                      582 non-null    object
 7   state                    700 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 43.9+ KB

In [22]:
df3["state"]=df3["place_with_parent_names"].str.split("|", expand=True)[2]
df3.drop(columns=["place_with_parent_names"], inplace= True)
df3.head()

,Unnamed: 0,property_type,area_m2,price_usd,lat,lon,state
0,1,apartment,71,48550.59,19.52589,-99.151703,Distrito Federal
1,2,house,233,168636.73,19.2640539,-99.5727534,Estado de México
2,3,house,300,86932.69,19.268629,-99.671722,Estado de México
3,4,house,275,263432.41,NaN,NaN,Morelos
4,5,apartment,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave

In [27]:
df = pd.concat([df1,df2,df3])
print(df.shape)
df.head()

(1854, 7)

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,house,Estado de México,19.560181,-99.233528,150,67965.56
1,2,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,3,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,4,apartment,Guerrero,16.829782,-99.911012,150,94308.80
5,6,house,Yucatán,21.052583,-89.538639,205,105191.37

In [28]:
df.to_excel(r"C:\Users\User\anaconda3\Lib\site-packages\sklearn\datasets\data\mexico folder\mexicocleanfinal.xlsx", index=False)